# Пользователь вводит номер буквы в алфавите. Определить, какая это буква.

alfa = int(input('Введите номер буквы: '))

print(chr(alfa))
